      **********************************
      *** Author: Dracma Capital     ***
      *** Date:   April 17 from 2026 ***
      *** Update: April 17 from 2026 ***
      *** License: AGPL-3-or-later   ***
      **********************************

      *****************************************************************
       FD FC-SETTING-JSON
           RECORDING MODE IS F.
       01 FS-SETING-JSON-RECORD PIC X(2000).
      *****************************************************************