      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SXMM_GENERATE_REPORT.
       AUTHOR. Dracma Capital.
       DATE-WRITTEN.  April 4  from 2026.
       DATE-COMPILED. April 14 from 2026.
      *****************************************************************

      *****************************************************************
       ENVIRONMENT DIVISION.
      *****************************************************************

      *****************************************************************
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       COPY "file/control/report.cpy".
      *****************************************************************

      *****************************************************************
       DATA DIVISION.
      *****************************************************************

      *****************************************************************
       FILE SECTION.

       COPY "file/section/report.cpy".
      *****************************************************************

      *****************************************************************
       WORKING-STORAGE SECTION.

       COPY "data/working/report.cpy".
      *****************************************************************

      *****************************************************************
       LINKAGE SECTION.
      *****************************************************************

      *****************************************************************
       PROCEDURE DIVISION.
      *****************************************************************

      *****************************************************************
       INIT-PROGRAM.
           CONTINUE.
      *****************************************************************

      *****************************************************************
       LOGIC-PROGRAM.
           CONTINUE.
      *****************************************************************

      *****************************************************************
       FREE-PROGRAM.
           CONTINUE.
           GOBACK.
      *****************************************************************