      * SPDX-License-Identifier: AGPL-3-or-later

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SXMM_BID_SIZE.
       AUTHOR. Dracma Capital.
       DATE-WRITTEN.  April 4 from 2026.
       DATE-COMPILED. April 4 from 2026.

       PROCEDURE DIVISION.

           GOBACK.