      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SXMM_INVENTORY.
       AUTHOR. Dracma Capital.
       DATE-WRITTEN.  April 04 from 2026.
       DATE-COMPILED. April 17 from 2026.
      *****************************************************************

      *****************************************************************
       ENVIRONMENT DIVISION.
      *****************************************************************

      *****************************************************************
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       COPY "file/control/setting.cpy".
      *****************************************************************

      *****************************************************************
       DATA DIVISION.
      *****************************************************************

      *****************************************************************
       FILE SECTION.

       COPY "file/section/setting.cpy".
      *****************************************************************

      *****************************************************************
       WORKING-STORAGE SECTION.

       COPY "data/working/setting.cpy".
      *****************************************************************

      *****************************************************************
       PROCEDURE DIVISION.
      *****************************************************************

      *****************************************************************
       INIT-PROGRAM.
           CONTINUE.
      *****************************************************************

      *****************************************************************
       LOGIC-PROGRAM.
           CONTINUE.
      *****************************************************************

      *****************************************************************
       FREE-PROGRAM.
           GOBACK.
      *****************************************************************